app/controllers/home_controller.rb

  def index
    @quotes = current_user.all_quotes
    @last_quote = current_user.quotes.last
---
SELECT * FROM "quotes" WHERE ("quotes".user_id = 1) ORDER BY quotes.id DESC LIMIT 1

  def show
    @user = User.find_by_username params[:username]
---
SELECT * FROM "users" WHERE ("users"."username" = 'rigoberto_kovacek') LIMIT 1

  def toggle_follow
    @user = User.find_by_username params[:username]
---
SELECT * FROM "users" WHERE ("users"."username" = 'rigoberto_kovacek') LIMIT 1

  def toggle_follow_via_ajax
    user = User.find_by_username params[:username]
---
SELECT * FROM "users" WHERE ("users"."username" = 'nolan_hoeger') LIMIT 1

  def remove_friend
    friend = User.find_by_username params[:username]
---
SELECT * FROM "users" WHERE ("users"."username" = 'rigoberto_kovacek') LIMIT 1

  def search
    @q = params[:q]
    @users = User.find_by_search_query(@q)
    @users.delete(current_user) if @users.include? current_user
---
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users".id = "friendships".friend_id WHERE (("friendships".user_id = 1))