app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("created_at", "user_id", "message") VALUES('2010-02-03 13:48:09', 1, '<script>alert(''Hello'');</script>')
---
  def create
    quote = current_user.quotes.build(params[:quote])
    quote.message = quote.message[0..139]
    quote.created_at = Time.now # Hack, have to figure why created_at not automatically updated